reviewlize website files/app/controllers/reviewlize_controller.rb

  def scrape_product
    product_url = params[:product_url]
    @reviews = AmazonProductScrapper.scrape(product_url)

    response = Faraday.post("http://localhost:5000/predict", {sentences: @reviews}.to_json, "Content-Type" => "application/json")
    response = JSON.parse(response.body)
    #response = JSON.parse("{\"results\":{\"aspect_analize\":{\"funny\":{\"negative\":#{rand(10)},\"neutral\":0,\"positive\":#{rand(10)}},\"screen\":{\"negative\":#{rand(10)},\"neutral\":#{rand(10)},\"positive\":#{rand(10)}},\"signs\":{\"negative\":#{rand(10)},\"neutral\":3,\"positive\":#{rand(10)}},\"that\":{\"negative\":#{rand(10)},\"neutral\":1,\"positive\":#{rand(10)}},\"when\":{\"negative\":#{rand(10)},\"neutral\":1,\"positive\":#{rand(10)}}},\"aspects\":[\"that\",\"signs\",\"when\",\"signs\",\"funny\",\"screen\"],\"filtered\":[[\"signs\",\"minimal\"],[\"signs\",\"when\"],[\"signs\",\"wear\"],[\"signs\",\"damage\"],[\"signs\",\"showed\"],[\"screen\",\"great\"],[\"funny\",\"kind\"],[\"when\",\"notes\"],[\"that\",\"do\"]]},\"resultss\":1}")

    all_pos = 0
    all_neg = 0
    response["results"]["aspect_analize"].each do |k,v|
      all_neg += v["negative"]
      all_pos += v["positive"]
    end
    rate = (all_pos.to_f/(all_pos+all_neg)*5).round(2)

    Product.find_by(url: product_url).update(result: response.to_json, rate: rate, analyzed_reviews_count: @reviews.size)

    response["rate"] = rate
    response["reviews_count"] = @reviews.size
---
SELECT  "products".* FROM "products" WHERE "products"."url" = $1 LIMIT $2  [["url", "https://www.amazon.com/Apple-iPhone-Max-256GB-Gold/dp/B08BF4NMK7/"], ["LIMIT", 1]]
UPDATE "products" SET "result" = $1, "rate" = $2, "analyzed_reviews_count" = $3, "updated_at" = $4 WHERE "products"."id" = $5
SELECT  "products".* FROM "products" WHERE "products"."url" = $1 LIMIT $2  [["url", "https://www.amazon.com/Samsung-Smartphone-Unlocked-Phantom-Renewed/dp/B08VLMQ3KS/"], ["LIMIT", 1]]

  def analyze
    if current_user && params[:history]
      @products = []
      @history_record = HistoryRecord.find_by(id: params[:history_record_id])
      @history_record.history_products.each do |hp|
        @products << hp.product
      end
    else
      unless params[:products].present?
        flash[:error] = "Choose at least one product to analyze!"
        return redirect_back fallback_location: root_path
      end
      if current_user
        @history_record = current_user.history_records.create(search_title: params[:search_title])
      end
      @products = []
      params[:products].each do |prod|
        prod = eval(prod)
        product = Product.find_by(url: prod[:url])
        unless product.present?
          product = Product.create(name: prod[:title], url: prod[:url], image_url: prod[:image], price: prod[:price], supported_website: SupportedWebsite.find_by(base_url: "#{prod[:url].split('.com').first}.com"))
        end
        @products << product
        @history_record.history_products.create(product: product) if @history_record.present?
        @not_all_stored = true if product.result == nil
      end
      if @history_record.present?
        if @products.size > 1
          @history_record.update(analysis_type: 0)
        else
          @history_record.update(analysis_type: 1)
---
SELECT  "history_records".* FROM "history_records" WHERE "history_records"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
SELECT "history_products".* FROM "history_products" WHERE "history_products"."history_record_id" = $1  [["history_record_id", 16]]
INSERT INTO "products" ("name", "url", "image_url", "price", "supported_website_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "history_products" ("history_record_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["history_record_id", 1], ["product_id", 19], ["created_at", "2021-06-09 15:07:32.215530"], ["updated_at", "2021-06-09 15:07:32.215530"]]
INSERT INTO "history_records" ("search_title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["search_title", "samsung s21"], ["user_id", 1], ["created_at", "2021-06-09 15:07:31.922685"], ["updated_at", "2021-06-09 15:07:31.922685"]]
SELECT  "products".* FROM "products" WHERE "products"."url" = $1 LIMIT $2  [["url", "https://www.amazon.com/dp/B08QXFPWXH"], ["LIMIT", 1]]
SELECT  "supported_websites".* FROM "supported_websites" WHERE "supported_websites"."base_url" = $1 LIMIT $2  [["base_url", "https://www.amazon.com"], ["LIMIT", 1]]
UPDATE "history_records" SET "analysis_type" = $1, "updated_at" = $2 WHERE "history_records"."id" = $3  [["analysis_type", 0], ["updated_at", "2021-07-25 17:11:32.525493"], ["id", 13]]
UPDATE "history_records" SET "analysis_type" = $1, "updated_at" = $2 WHERE "history_records"."id" = $3  [["analysis_type", 1], ["updated_at", "2021-06-09 15:07:32.222428"], ["id", 1]]